Repository: team-unstablers/NoctilucaServer
Catalog: NoctilucaClient/NoctilucaClient/resources/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans

# settings.security.protocol.disable_version_announcement.title
source: 클라이언트 버전을 알리지 않기
en: Do Not Announce Client Version
ja: クライアントバージョンを通知しない
zh_hans: 不通报客户端版本

# settings.security.protocol.header
source: 프로토콜
en: Protocol
ja: プロトコル
zh_hans: 协议

# settings.security.protocol.header.description
source: Sirius 프로토콜의 동작 방식을 구성합니다.
en: Configure how the Sirius protocol behaves.
ja: Siriusプロトコルの動作方式を構成します。
zh_hans: 配置 Sirius 协议的行为方式。

# settings.security.tls_validation.default.description
source: 모든 호스트가 신뢰받은 인증 기관으로부터 SSL/TLS 인증서를 발급받을 수 없다는 상황을 감안합니다. 자가 서명 인증서를 사용한 호스트의 경우 경고 팝업을 표시합니다.
en: Accommodates the situation where not all hosts can get SSL/TLS certificates from trusted CAs. Displays a warning popup for hosts using self-signed certificates.
ja: すべてのホストが信頼された認証局からSSL/TLS証明書を発行してもらえない状況を考慮します。 自己署名証明書を使用したホストの場合、警告ポップアップを表示します。
zh_hans: 考虑到并非所有主机都能从受信任的证书颁发机构获取 SSL/TLS 证书的情况。 如果是使用自签名证书的主机，则会显示警告弹窗。

# settings.security.tls_validation.default.title
source: 기본
en: Default
ja: デフォルト
zh_hans: 默认

# settings.security.tls_validation.description
source: 서버의 SSL/TLS 인증서의 유효성 검사 수준을 설정합니다.
en: Set validation level for server SSL/TLS certificate.
ja: サーバーのSSL/TLS証明書の検証レベルを設定します。
zh_hans: 设置服务器 SSL/TLS 证书的验证级别。

# settings.security.tls_validation.strict.description
source: 시스템의 트러스트 스토어를 기준으로 서버의 SSL/TLS 인증서를 엄격하게 검사합니다. 자가 서명 인증서를 사용 중인 호스트의 경우 연결에 실패할 수 있습니다.
en: Strictly validate server SSL/TLS certificates against the system trust store. Connections to hosts using self-signed certificates may fail.
ja: システムのトラストストアを基準にサーバーのSSL/TLS証明書を厳格に検証します。 自己署名証明書を使用中のホストの場合、接続に失敗する可能性があります。
zh_hans: 根据系统信任存储库严格检查服务器的 SSL/TLS 证书。 如果是使用自签名证书的主机，连接可能会失败。

# settings.security.tls_validation.strict.title
source: 엄격히
en: Strict
ja: 厳格に
zh_hans: 严格

# settings.security.tls_validation.title
source: 유효성 검사 정책
en: Validation Policy
ja: 検証ポリシー
zh_hans: 验证策略

# settings.security.tls_validation.unsafe.description
source: 서버의 SSL/TLS 인증서의 유효성 검사를 수행하지 않습니다. 제 3자가 통신 내용을 훔쳐보거나 변조하는 중간자 공격 (MITM)에 취약하므로 권장하지 않습니다.
en: Do not validate the server's SSL/TLS certificate. Not recommended as it is vulnerable to Man-in-the-Middle (MITM) attacks where a third party could eavesdrop on or tamper with communication.
ja: サーバーのSSL/TLS証明書の検証を行いません。 第三者が通信内容を盗聴したり改ざんする中間者攻撃 (MITM) に脆弱なため推奨しません。
zh_hans: 不验证服务器的 SSL/TLS 证书有效性。 这容易受到第三方窃听或篡改通信内容的中间人攻击 (MITM) 威胁，因此不建议使用。

# settings.security.tls_validation.unsafe.title
source: 수행하지 않기 **(위험!)**
en: Do Not Perform **(Dangerous!)**
ja: 検証しない **(危険!)**
zh_hans: 不执行 **(危险!)**

# settings.security.transport.header
source: 트랜스포트 레이어
en: Transport Layer
ja: トランスポート層
zh_hans: 传输层

# settings.security.transport.header.description
source: Noctiluca에서는 QUIC 프로토콜을 사용하여 통신합니다.
en: Noctiluca communicates using the QUIC protocol.
ja: NoctilucaではQUICプロトコルを使用して通信します。
zh_hans: Noctiluca 使用 QUIC 协议进行通信。

# settings.tabs.about
source: 정보
en: About
ja: 情報
zh_hans: 关于

# settings.tabs.general
source: 일반
en: General
ja: 一般
zh_hans: 通用

# settings.tabs.input
source: 입력
en: Input
ja: 入力
zh_hans: 输入

# settings.tabs.misc
source: 기타
en: Misc
ja: その他
zh_hans: 其他

# settings.tabs.plugins
source: 플러그인
en: Plugins
ja: プラグイン
zh_hans: 插件

# settings.tabs.projection
source: 프로젝션
en: Projection
ja: プロジェクション
zh_hans: 投影

# settings.tabs.security
source: 보안
en: Security
ja: セキュリティ
zh_hans: 安全

# settings.title
source: 설정
en: Settings
ja: 設定
zh_hans: 设置

source: 소프트웨어 키보드 토글
en: Toggle Software Keyboard
zh_hans: 切换软件键盘

# Resolution: %lld x %lld
source: Resolution: %1$lld x %2$lld
ja: 解像度: %1$lld x %2$lld
zh_hans: 分辨率: %1$lld x %2$lld

# session-settings.projection.codec_list.template.h264.title
source: Advanced Video Coding (H.264)
zh_hans: 高级视频编码 (H.264)

# session-settings.projection.codec_list.template.hevc.title
source: High Efficiency Video Coding (H.265)
zh_hans: 高效视频编码 (H.265)
